taskjuggler-example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-15 Thu 13:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TaskJuggler (TJ) org file example (noob friendly)</title>
<meta name="author" content="Manuel Fuica Morales - [[mailto:manuel.fuica.morales@gmail.com][manuel.fuica.morales@gmail.com]]" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">TaskJuggler (TJ) org file example (noob friendly)
<br />
<span class="subtitle">extract from <code>orgmode.org/worg/org-tutorials/org-taskjuggler.org</code></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb503300">1. Accounting Software&#xa0;&#xa0;&#xa0;<span class="tag"><span class="taskjuggler_project">taskjuggler_project</span></span></a>
<ul>
<li><a href="#orge89d3b9">1.1. Specification</a></li>
<li><a href="#org2c68117">1.2. Software Development</a></li>
<li><a href="#org2c25357">1.3. Software testing</a></li>
<li><a href="#org33f8d47">1.4. Manual</a></li>
<li><a href="#org68dad65">1.5. Milestones</a></li>
</ul>
</li>
<li><a href="#org8687239">2. Resources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="taskjuggler_resource">taskjuggler_resource</span></span></a>
<ul>
<li><a href="#org27bcc7c">2.1. Developers</a></li>
<li><a href="#org0572403">2.2. Others</a></li>
</ul>
</li>
<li><a href="#orgf5051fc">3. About (noob friendly part)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb503300" class="outline-2">
<h2 id="orgb503300"><span class="section-number-2">1</span> Accounting Software&#xa0;&#xa0;&#xa0;<span class="tag"><span class="taskjuggler_project">taskjuggler_project</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge89d3b9" class="outline-3">
<h3 id="orge89d3b9"><span class="section-number-3">1.1</span> Specification</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>

<div id="outline-container-org2c68117" class="outline-3">
<h3 id="org2c68117"><span class="section-number-3">1.2</span> Software Development</h3>
<div class="outline-text-3" id="text-1-2">
</div>

<div id="outline-container-org56036d3" class="outline-4">
<h4 id="org56036d3"><span class="section-number-4">1.2.1</span> Database coupling</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
</div>

<div id="outline-container-orgafa0dcf" class="outline-4">
<h4 id="orgafa0dcf"><span class="section-number-4">1.2.2</span> Back-End Functions</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
</div>

<div id="outline-container-org0135b89" class="outline-4">
<h4 id="org0135b89"><span class="section-number-4">1.2.3</span> Graphical User Interface</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
</div>
</div>

<div id="outline-container-org2c25357" class="outline-3">
<h3 id="org2c25357"><span class="section-number-3">1.3</span> Software testing</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org8c37c6c" class="outline-4">
<h4 id="org8c37c6c"><span class="section-number-4">1.3.1</span> Alpha Test</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
</div>

<div id="outline-container-orgf55ca8a" class="outline-4">
<h4 id="orgf55ca8a"><span class="section-number-4">1.3.2</span> Beta Test</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
</div>
</div>

<div id="outline-container-org33f8d47" class="outline-3">
<h3 id="org33f8d47"><span class="section-number-3">1.4</span> Manual</h3>
<div class="outline-text-3" id="text-1-4">
</div>
</div>

<div id="outline-container-org68dad65" class="outline-3">
<h3 id="org68dad65"><span class="section-number-3">1.5</span> Milestones</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgf7a2123" class="outline-4">
<h4 id="orgf7a2123"><span class="section-number-4">1.5.1</span> Project start</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
</div>

<div id="outline-container-org2a022e3" class="outline-4">
<h4 id="org2a022e3"><span class="section-number-4">1.5.2</span> Technology Preview</h4>
<div class="outline-text-4" id="text-1-5-2">
</div>
</div>

<div id="outline-container-orgf6ad703" class="outline-4">
<h4 id="orgf6ad703"><span class="section-number-4">1.5.3</span> Beta version</h4>
<div class="outline-text-4" id="text-1-5-3">
</div>
</div>

<div id="outline-container-orgc36cf7c" class="outline-4">
<h4 id="orgc36cf7c"><span class="section-number-4">1.5.4</span> Ship Product to Customer</h4>
<div class="outline-text-4" id="text-1-5-4">
</div>
</div>
</div>
</div>
<div id="outline-container-org8687239" class="outline-2">
<h2 id="org8687239"><span class="section-number-2">2</span> Resources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="taskjuggler_resource">taskjuggler_resource</span></span></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org27bcc7c" class="outline-3">
<h3 id="org27bcc7c"><span class="section-number-3">2.1</span> Developers</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org7e98cab" class="outline-4">
<h4 id="org7e98cab"><span class="section-number-4">2.1.1</span> Paul Smith</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
</div>
<div id="outline-container-orgef1f575" class="outline-4">
<h4 id="orgef1f575"><span class="section-number-4">2.1.2</span> Sébastien Bono</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
</div>
<div id="outline-container-org8981089" class="outline-4">
<h4 id="org8981089"><span class="section-number-4">2.1.3</span> Klaus Müller</h4>
</div>
</div>

<div id="outline-container-org0572403" class="outline-3">
<h3 id="org0572403"><span class="section-number-3">2.2</span> Others</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgf5caf36" class="outline-4">
<h4 id="orgf5caf36"><span class="section-number-4">2.2.1</span> Peter Murphy</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
</div>
<div id="outline-container-org2f93006" class="outline-4">
<h4 id="org2f93006"><span class="section-number-4">2.2.2</span> Dim Sung</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
</div>
</div>
</div>
<div id="outline-container-orgf5051fc" class="outline-2">
<h2 id="orgf5051fc"><span class="section-number-2">3</span> About (noob friendly part)</h2>
<div class="outline-text-2" id="text-3">
<p>
From
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/worg/org-tutorials/org-taskjuggler.html">https://orgmode.org/worg/org-tutorials/org-taskjuggler.html</a></li>
</ul>


<p>
Check the source code and near the end of the document there is a
complete <code>#+begin_src org</code> source block that I copied into its own file
(this one) and used <code>org-taskjuggler-export-process-and-open</code> orgmode&rsquo;s export
capabilities to generate the <code>reports/Plan.html</code> file.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Program</th>
<th scope="col" class="org-center">Version</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">Orgmode</td>
<td class="org-center">9.5</td>
<td class="org-left"><code>M-x org-version</code> (from within emacs)</td>
</tr>

<tr>
<td class="org-center">Emacs</td>
<td class="org-center">27.1</td>
<td class="org-left"><code>emacs --version</code> (from terminal)</td>
</tr>

<tr>
<td class="org-center">Doom Emacs</td>
<td class="org-center">3.0.0</td>
<td class="org-left"><code>doom --version</code> (from terminal)</td>
</tr>

<tr>
<td class="org-center">tj3 (TaskJuggler)</td>
<td class="org-center">3.6.0</td>
<td class="org-left"><code>tj3 --version</code> (from terminal)</td>
</tr>
</tbody>
</table>
<p>
Fetched: <span class="timestamp-wrapper"><span class="timestamp">[2021-07-15 Thu]</span></span>
</p>

<p>
Notice that if you don&rsquo;t have TaskJuggler installed (<code>tj3</code> in this case) then
Emacs will generate an empty <code>reports</code> directory. <code>tj3</code> actually populates
that <code>reports</code> directory according to the information in your <code>.org</code> file.
</p>

<p>
For <code>Doom Emacs</code> users
</p>
<ul class="org-ul">
<li>There&rsquo;s <i>no</i> particular <code>flag</code> nor <code>module</code> you have to enable
(well obviously <code>:lang org</code> in <code>~/.doom.d/init.el</code>, but that is taken
as granted).</li>
</ul>

<p>
For Ubuntu users it&rsquo;ll be
</p>

<ul class="org-ul">
<li><code>sudo apt install tj3</code></li>
<li>or you can search it
<ul class="org-ul">
<li><code>apt search taskjuggler</code></li>
</ul></li>
</ul>


<p>
and wing it from there.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 15 July 2021</p>
<p class="author">Author: Manuel Fuica Morales - <a href="mailto:manuel.fuica.morales@gmail.com">manuel.fuica.morales@gmail.com</a></p>
<p class="date">Created: 2021-07-15 Thu 13:37</p>
</div>
</body>
</html>
